In [1]:
import sqlite3
import pandas as pd

In [2]:
def create_connection(db_file):
    """ create a database connection to the SQLite database
    specified by db_file
    :param db_file: database file
    :return: Connection object or None
    """
    try:
        conn = sqlite3.connect(db_file)
        return conn
    except Error as e:
        print(e)
 
    return None

## Adding, Altering and Deleting Data

In [3]:
dbfile = 'data/hubway.db'

---

In [17]:
query = """
CREATE TABLE IF NOT EXISTS mytable(
   col_zero INTEGER PRIMARY KEY,
   col_one type NOT NULL,
   col_two type NULL,
   col_int type INTEGER
);

"""

In [18]:
with create_connection(dbfile) as conn:
    conn.execute(query)

In [19]:
pd.read_sql_query('SELECT * FROM mytable', create_connection(dbfile))

Empty DataFrame
Columns: [col_zero, col_one, col_two, col_int]
Index: []

---

#### INSERT

In [20]:
query = """
INSERT INTO mytable(col_one, col_two, col_int)
VALUES ("hello", "world", 1);

"""

In [21]:
with create_connection(dbfile) as conn:
    conn.execute(query)

In [22]:
pd.read_sql_query('SELECT * FROM mytable', create_connection(dbfile))

   col_zero col_one col_two  col_int
0         1   hello   world        1

---

#### UPDATE

In [23]:
query = """
UPDATE mytable SET col_two = "earth"
WHERE col_two = "world";
"""

In [24]:
with create_connection(dbfile) as conn:
    conn.execute(query)

In [25]:
pd.read_sql_query('SELECT * FROM mytable', create_connection(dbfile))

   col_zero col_one col_two  col_int
0         1   hello   earth        1

---

#### TRANSACTIONS

In [28]:
query1 = """
UPDATE mytable SET col_two = "mars"
WHERE col_two = "earth";
"""
query2 = """
UPDATE mytable SET col_two = "venus"
WHERE col_two = "mars";
"""

In [29]:
with create_connection(dbfile) as conn:
    conn.execute("begin")
    conn.execute(query1)
    conn.execute(query2)
    conn.execute("commit")

In [30]:
pd.read_sql_query('SELECT * FROM mytable', create_connection(dbfile))

   col_zero col_one col_two  col_int
0         1   hello   venus        1

---

In [15]:
query = """
DROP TABLE IF EXISTS mytable;
"""

In [16]:
with create_connection(dbfile) as conn:
    conn.execute(query)